# Pandas Basics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [3]:
s = pd.Series([2, 4, 6, 8, 10])
s

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [7]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [8]:
df.tail()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [9]:
df.shape

(5, 3)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       5 non-null      int64
 1   Y       5 non-null      int64
 2   Z       5 non-null      int64
dtypes: int64(3)
memory usage: 184.0 bytes

In [11]:
df.describe()

          X          Y          Z
count   5.0   5.000000   5.000000
mean   85.0  87.200000  86.800000
std     7.0   4.438468  10.281051
min    78.0  83.000000  72.000000
25%    80.0  84.000000  83.000000
50%    85.0  86.000000  86.000000
75%    86.0  89.000000  96.000000
max    96.0  94.000000  97.000000

In [12]:
df['Y']

0    84
1    94
2    89
3    83
4    86
Name: Y, dtype: int64

In [13]:
df[['Y', 'Z']]

    Y   Z
0  84  86
1  94  97
2  89  96
3  83  72
4  86  83

In [15]:
df.iloc[0]

X    78
Y    84
Z    86
Name: 0, dtype: int64

In [16]:
df.iloc[:, 0]

0    78
1    85
2    96
3    80
4    86
Name: X, dtype: int64

In [20]:
df.iloc[3:5, 2]

3    72
4    83
Name: Z, dtype: int64

In [21]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [22]:
df.iloc[1:4, 1]

1    94
2    89
3    83
Name: Y, dtype: int64

In [24]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [25]:
df.columns = ['apple', 'banana', 'orange']

In [26]:
df

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [27]:
df['banana'].mean()

87.2

In [28]:
df['banana'].min()

83

In [29]:
df['banana'].max()

94

In [30]:
df['banana'].std()

4.43846820423443

In [33]:
df['banana'].count()

5

In [32]:
df['banana'].sort_values(ascending = False)

1    94
2    89
4    86
0    84
3    83
Name: banana, dtype: int64

In [37]:
df[['apple', 'orange']]

   apple  orange
0     78      86
1     85      97
2     96      96
3     80      72
4     86      83

In [39]:
df.iloc[2, :]

apple     96
banana    89
orange    96
Name: 2, dtype: int64

In [41]:
df['orange'].sort_values(ascending = False)

1    97
2    96
0    86
4    83
3    72
Name: orange, dtype: int64

In [43]:
df.sort_values(by = 'apple', ascending = False)

   apple  banana  orange
2     96      89      96
4     86      86      83
1     85      94      97
3     80      83      72
0     78      84      86

In [49]:
df[df.orange >= 72]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [50]:
df[(df.orange >= 72) & (df.apple >= 90)]

   apple  banana  orange
2     96      89      96

In [52]:
df[(df.orange >= 72) | (df.apple >= 90)]

   apple  banana  orange
0     78      84      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [54]:
df['banana'].replace(84, 50)

0    50
1    94
2    89
3    83
4    86
Name: banana, dtype: int64

In [56]:
df['banana'] = df['banana'].replace(84, 50)

In [57]:
df

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [59]:
df[df.orange >= 72]

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [60]:
df

   apple  banana  orange
0     78      50      86
1     85      94      97
2     96      89      96
3     80      83      72
4     86      86      83

In [66]:
df[df.apple == 80]

   apple  banana  orange
3     80      83      72